apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m0_v1.c
      canerr("ERROR: Received CAN FD message.  Dropped\n");

      return;
    }
#endif

  /* And provide the CAN message to the upper half logic */

  ret = can_receive(dev, &hdr, (uint8_t *)&rxbuffer[2]);
  if (ret < 0)
    {
      canerr("ERROR: can_receive failed: %d\n", ret);
    }
}

/****************************************************************************
 * Name: fdcan_interrupt
 *
 * Description:
 *   Common FDCAN interrupt handler
 *
 * Input Parameters:
 *   dev - CAN-common state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int fdcan_interrupt(int irq, void *context, void *arg)
{
  struct can_dev_s            *dev     = (struct can_dev_s *)arg;
  struct stm32_fdcan_s        *priv    = NULL;
  const struct stm32_config_s *config  = NULL;
  uint32_t                     ir      = 0;
  uint32_t                     ie      = 0;
  uint32_t                     pending = 0;
  uint32_t                     regval  = 0;
  uint32_t                     psr     = 0;
  unsigned int                 nelem   = 0;
  unsigned int                 ndx     = 0;

  DEBUGASSERT(dev != NULL);
  priv = dev->cd_priv;
  DEBUGASSERT(priv && priv->config);
  config = priv->config;

  /* Get the set of pending interrupts. */

  ir = fdcan_getreg(priv, STM32_FDCAN_IR_OFFSET);
  ie = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  pending = (ir & ie);

  /* Check for any errors */

  if ((pending & FDCAN_ANYERR_INTS) != 0)
    {
      /* Check for common errors */

      if ((pending & FDCAN_CMNERR_INTS) != 0)
        {
          canerr("ERROR: Common %08" PRIx32 "\n",
                 pending & FDCAN_CMNERR_INTS);

          /* When a protocol error occurs, the problem is recorded in
           * the LEC/DLEC fields of the PSR register. In lieu of
           * separate interrupt flags for each error, the hardware
           * groups protocol errors under a single interrupt each for
           * arbitration and data phases.
           *
           * These errors have a tendency to flood the system with
           * interrupts, so they are disabled here until we get a
           * successful transfer/receive on the hardware
           */

          psr = fdcan_getreg(priv, STM32_FDCAN_PSR_OFFSET);

          if ((psr & FDCAN_PSR_LEC_MASK) != 0)
            {
              canerr("ERROR: PSR %08" PRIx32 "\n", psr);
              ie &= ~(FDCAN_INT_PEA | FDCAN_INT_PED);
              fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);
              caninfo("disabled protocol error interrupts\n");
            }

          /* Clear the error indications */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_CMNERR_INTS);
        }

      /* Check for transmission errors */

      if ((pending & FDCAN_TXERR_INTS) != 0)
        {
          canerr("ERROR: TX %08" PRIx32 "\n",
                 pending & FDCAN_TXERR_INTS);

          /* An Acknowledge-Error will occur if for example the device
           * is not connected to the bus.
           *
           * The CAN-Standard states that the Chip has to retry the
           * message forever, which will produce an ACKE every time.
           * To prevent this Interrupt-Flooding and the high CPU-Load
           * we disable the ACKE here as long we didn't transfer at
           * least one message successfully (see FDCAN_INT_TC below).
           */

          /* Clear the error indications */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_TXERR_INTS);
        }

      /* Check for reception errors */

      if ((pending & FDCAN_RXERR_INTS) != 0)
        {
          canerr("ERROR: RX %08" PRIx32 "\n",
                 pending & FDCAN_RXERR_INTS);

          /* To prevent Interrupt-Flooding the current active
           * RX error interrupts are disabled. After successfully
           * receiving at least one CAN packet all RX error interrupts
           * are turned back on.
           *
           * The Interrupt-Flooding can for example occur if the
           * configured CAN speed does not match the speed of the other
           * CAN nodes in the network.
           */

          ie &= ~(pending & FDCAN_RXERR_INTS);
          fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);

          /* Clear the error indications */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_RXERR_INTS);
        }

#ifdef CONFIG_CAN_ERRORS
      /* Report errors */

      fdcan_error(dev, pending & FDCAN_ANYERR_INTS);
#endif
    }

  /* Check for successful completion of a transmission */

  if ((pending & FDCAN_INT_TC) != 0)
    {
      /* Check if we have disabled the ACKE in the error-handling above
       * (see FDCAN_TXERR_INTS) to prevent Interrupt-Flooding and
       * re-enable the error interrupt here again.
       */

      if ((ie & (FDCAN_INT_PEA | FDCAN_INT_PED)) == 0)
        {
          ie |= (FDCAN_INT_PEA | FDCAN_INT_PED);
          fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);
          caninfo("Re-enabled protocol error interrupts\n");
        }

      /* Clear the pending TX completion interrupt (and all
       * other TX-related interrupts)
       */

      fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, priv->txints);

      /* Check all TX buffers */

      regval = fdcan_getreg(priv, STM32_FDCAN_TXBTO_OFFSET);
      for (ndx = 0; ndx < config->ntxfifoq; ndx++)
        {
          if ((regval & (1 << ndx)) != 0)
            {
              /* Tell the upper half that the transfer is finished. */

              can_txdone(dev);
            }
        }
    }
  else if ((pending & priv->txints) != 0)
    {
      /* Clear unhandled TX events */

      fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, priv->txints);
    }

  /* Clear the RX FIFO1 new message interrupt */

  fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_INT_RF1N);
  pending &= ~FDCAN_INT_RF1N;

  /* We treat RX FIFO1 as the "high priority" queue:  We will process
   * all messages in RX FIFO1 before processing any message from RX
   * FIFO0.
   */

